Мюнцкабинент_30/src/InformationRegisters/СтоимостьОбъектовКоллекцинирования/СтоимостьОбъектовКоллекцинирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтоимостьОбъектовКоллекцинирования</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РегистраторЦен</name>
    <type>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.ПоступлениеВКоллекцию</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ВидыМонет</types>
      <types>CatalogRef.Монеты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мюнцкабинент_30/src/InformationRegisters/СтоимостьОбъектовКоллекцинирования/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РеквизитОбъект") Тогда
		Запись.Объект 					= Параметры.РеквизитОбъект; 
		Элементы.Объект.ТолькоПросмотр 	= Истина;
	КонецЕсли;
	
	Если Параметры.Свойство("ТипЦены") Тогда
		Запись.ТипЦены					= Параметры.ТипЦены
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда // новый
		Запись.РегистраторЦен 	= ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
	
КонецПроцедуры
